Documents/УдалитьКорректировкаИспользованияРаботникамиРабочегоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>УдалитьКорректировкаИспользованияРаботникамиРабочегоВремени</Name>
			<Comment>(Регл)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РабочееВремяРаботниковОрганизаций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазвернутыйПериод</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтработанноеВремя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Физлицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидИспользованияРабочегоВремени</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторИспользованияРабочегоВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоДнейПоНорме</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЧасовПоНорме</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаботникиОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятНаНовоеРабочееМесто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаботаСНефиксированнымРабочимВременем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНовогоРабочегоМеста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНовыхРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКЗоТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольненийИзОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГрафикиРаботыПоВидамВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиРаботыПоВидамВремени</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновноеЗначение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительноеЗначение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйКалендарьКалендарныеДни</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйКалендарьКалендарныеДниСПраздниками</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РабочееВремяРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>РабочееВремяРаботниковОрганизаций</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Часов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СводнаяЗапись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВЦеломЗаПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Comment>Это либо Сотрудник, либо Внутренний совместитель, либо Сотрудник которого Заменяем</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидИспользованияРабочегоВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыВремени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтработанноеВПределахНормы</Name>
					<Comment>Начисление за работу полную рабочую смену в пределах нормы времени</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтработанноеСверхНормы</Name>
					<Comment>Начисление за работу сверх нормы времени</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦелодневноеНеотработанное</Name>
					<Comment>Неотработанные полные смены</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧасовоеНеотработанное</Name>
					<Comment>Неотработанные неполные смены</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноОплачиваемоеВПределахНормы</Name>
					<Comment>Дополнительное начисление в пределах нормы времени</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧасовоеОтработанноеВПределахНормы</Name>
					<Comment>Начисление за работу неполную смену в пределах нормы времени</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПричиныИзмененияСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ПричиныИзмененияСостояния</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УдалитьКорректировкаИспользованияРаботникамиРабочегоВремени/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает список видов времени, которые нельзя вводить этим документом
//
// Параметры
//	Нет.
//
// Возвращаемое значение:
//	Список значений, содержащий подходящий перечень значений перечисления ВидыВремени
//
Функция ПолучитьСписокНедопустимыхВидовВремени() Экспорт
	
	Список = Новый СписокЗначений;
	Список.Добавить(Перечисления.ВидыВремени.ОтработанноеСверхНормы);
	Список.Добавить(Перечисления.ВидыВремени.ЧасовоеНеотработанное);
	
	Возврат Список;

КонецФункции // ПолучитьСписокНедопустимыхВидовВремени()

// Заполняет табличную часть РаботникиОрганизации, всеми физ лицами, которые числятся на конец периода по указанным координатам, 
// их дыижения и внутреннее совместительство 
// Всех не уволенных на конец ПериодаРасчета документа
//
Функция АвтозаполнениеРаботникиОрганизации() экспорт
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("парамСсылка"	, Ссылка);
	Запрос.УстановитьПараметр("парамНачало"	, НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамКонец"	, КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамОрганизация"	, Организация);
	Запрос.УстановитьПараметр("парамПользователь"	, Ответственный);
	Запрос.УстановитьПараметр("парамПодразделение"	, ПодразделениеОрганизации);
	
	Запрос.УстановитьПараметр("Уволен"		, Перечисления.ПричиныИзмененияСостояния.Увольнение);
	
 	// Проверим ответсвенного - является ли он расчетчиком вообще и для заданного 
 	// подразделения (если оно задано)
 
 	ПустоеПодразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
 	ПустойОтветственный = Справочники.Пользователи.ПустаяСсылка();
	
	ПустоеПодразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	ПустойОтветственный = Справочники.Пользователи.ПустаяСсылка();

    // Описание условий	
	Если ПодразделениеОрганизации = ПустоеПодразделение И Ответственный = ПустойОтветственный Тогда
		
		ПоВсемПодразделениямОрганизации = Истина;
		УсловиеНаПодразделение = "ПодразделениеОрганизации.Владелец = &парамОрганизация";
		
	ИначеЕсли ПодразделениеОрганизации = ПустоеПодразделение Тогда
		
			ПоВсемПодразделениямОрганизации = Истина;
			УсловиеНаПодразделение = "ПодразделениеОрганизации.Владелец = &парамОрганизация";
		
	Иначе
		
		ПоВсемПодразделениямОрганизации = Ложь;
		УсловиеНаПодразделение = "ПодразделениеОрганизации В ИЕРАРХИИ (&парамПодразделение)";
		
	КонецЕсли;
	
	ТекстЗапроса_ФизЛица = "";
	ТекстЗапроса_ФизЛица = ТекстЗапроса_ФизЛица+"
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Работники.Физлицо КАК Физлицо,
	|		Работники.Приказ КАК Приказ
	|	ИЗ	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамКонец, Организация = &парамОрганизация) КАК Работники
	|	ГДЕ		Работники.ЗанимаемыхСтавок > 0 
	|		И	Работники."+УсловиеНаПодразделение+"
	|	
	|	ОБЪЕДИНИТЬ  // вытащим всех уволенных за месяц
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Работники.Физлицо КАК Физлицо,
	|		Работники.Приказ КАК Приказ
	|	ИЗ	РегистрСведений.РаботникиОрганизаций КАК Работники
	|	ГДЕ		Работники.ЗанимаемыхСтавок = 0 
	|		И	Работники.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций
	|		И	Работники.Организация = &парамОрганизация
	|		И	Работники.Период >= &парамНачало
	|		И	Работники."+УсловиеНаПодразделение+"
	|";
	// Текст запроса: срез работников на конец месяца
	ТекстЗапросаАвтозаполнениеРаботники = "
	|ВЫБРАТЬ
	|	Сотрудники.Физлицо КАК Физлицо,  
	|	Сотрудники.Приказ КАК Приказ,
	|	РаботникиРасчитанныеДругимимДокументами.Физлицо  КАК Физлицо1,
	|	РаботникиРасчитанныеДругимимДокументами.Приказ  КАК Приказ1
	|ИЗ (" + ТекстЗапроса_ФизЛица + ") КАК Сотрудники		
	|		
	|ЛЕВОЕ СОЕДИНЕНИЕ (		
	|	ВЫБРАТЬ
	|		Работники.Физлицо КАК Физлицо,
	|		Работники.Приказ КАК Приказ
	|	ИЗ  Документ.КорректировкаИспользованияРаботникамиРабочегоВремени.РаботникиОрганизации КАК Работники
	|	ГДЕ		Работники.Ссылка <> &парамСсылка 
	|		И	Работники.Ссылка.ПериодРегистрации = &парамНачало
	|		И	Работники.Ссылка.Организация = &парамОрганизация
	|		И	Работники.Ссылка.ПометкаУдаления = ЛОЖЬ
	|		И	Работники.Ссылка.Проведен = ИСТИНА
	|) КАК РаботникиРасчитанныеДругимимДокументами		
	|ПО		РаботникиРасчитанныеДругимимДокументами.Физлицо = Сотрудники.Физлицо 		
	|	И	РаботникиРасчитанныеДругимимДокументами.Приказ = Сотрудники.Приказ 		
	|		
	|ГДЕ РаботникиРасчитанныеДругимимДокументами.Физлицо ЕСТЬ NULL		
	|";
	
	Запрос.Текст = ТекстЗапросаАвтозаполнениеРаботники;
	
    РаботникиОрганизации.Загрузить(Запрос.Выполнить().Выгрузить());

КонецФункции // АвтозаполнениеРаботникиОрганизации()

// Выполняет автоматическое заполнение документа по данным документа и переданным параметрам
// 
// Параметры:
//	Нет.
//
Процедура Автозаполнение( масСтрокФизЛиц, масФизЛиц) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	Запрос.УстановитьПараметр("парамСсылка",		Ссылка);
	Запрос.УстановитьПараметр("парамФизЛицо",		масФизЛиц);
	Запрос.УстановитьПараметр("парамСтроки",		масСтрокФизЛиц);
	Запрос.УстановитьПараметр("парамОрганизация",	Организация);
	Запрос.УстановитьПараметр("НачалоМесяца",		НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("КонецМесяца",		КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("ПоЧасам",			Перечисления.ВидыУчетаВремени.ПоЧасам);
	Запрос.УстановитьПараметр("ПоНочнымЧасам",		Перечисления.ВидыУчетаВремени.ПоНочнымЧасам);
	Запрос.УстановитьПараметр("ПоВечернимЧасам",	Перечисления.ВидыУчетаВремени.ПоВечернимЧасам);
	
	УчетВремениНочноеВремя		= ПланыВидовРасчета.Начисления.ДоплатаЗаНочныеЧасы.ОбозначениеВТабелеУчетаРабочегоВремени;
	УчетВремениВечернееВремя	= ПланыВидовРасчета.Начисления.ДоплатаЗаВечерниеЧасы.ОбозначениеВТабелеУчетаРабочегоВремени;
	Запрос.УстановитьПараметр("УчетВремениНочноеВремя",		УчетВремениНочноеВремя);
	Запрос.УстановитьПараметр("УчетВремениВечернееВремя",	УчетВремениВечернееВремя);
	              
	МассивОтработанноеВремя = Новый Массив;
	МассивОтработанноеВремя.Добавить(Перечисления.ВидыВремени.ОтработанноеВПределахНормы);
	МассивОтработанноеВремя.Добавить(Перечисления.ВидыВремени.ЧасовоеОтработанноеВПределахНормы);
	Запрос.УстановитьПараметр("ОтработанноеВремя", МассивОтработанноеВремя);
	              
	МассивНочныеВечерние = Новый Массив;
	МассивНочныеВечерние.Добавить(ПланыВидовРасчета.Начисления.ДоплатаЗаНочныеЧасы);
	МассивНочныеВечерние.Добавить(ПланыВидовРасчета.Начисления.ДоплатаЗаВечерниеЧасы);
	Запрос.УстановитьПараметр("парамНочныеВечерние", МассивНочныеВечерние);
	
	Запрос.Текст = Автозаполнение_РабочееВремя(Запрос, ПериодРегистрации);
	
	//РезультатЗапроса = Запрос.Выполнить();
	//ОтработанноеВремя.Загрузить(РезультатЗапроса.Выгрузить());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		 НоваяСтрока = ОтработанноеВремя.Добавить();
		 НоваяСтрока.Физлицо		= Выборка.Физлицо;
		 НоваяСтрока.Приказ			= Выборка.Приказ;
		 НоваяСтрока.ДатаНачала		= Выборка.ДатаНачала;
		 НоваяСтрока.ДатаОкончания	= Выборка.ДатаОкончания;
		 НоваяСтрока.ВсегоДней		= Выборка.ВсегоДней;
		 НоваяСтрока.ВсегоЧасов		= Выборка.ВсегоЧасов;
		 НоваяСтрока.ВидИспользованияРабочегоВремени	= Выборка.ВидИспользованияРабочегоВремени;
	КонецЦикла;
	
КонецПроцедуры // Автозаполнение()

Функция		Автозаполнение_ТабличнаяЧастьРаботники()
	
	ТекстЗапроса = "
	|// -начало Автозаполнение_ТабличнаяЧастьРаботники()                              
	|ВЫБРАТЬ
	|	РаботникиОрганизации.ФизЛицо	КАК ФизЛицо,
	|	РаботникиОрганизации.Приказ		КАК Приказ
	|ИЗ	Документ."+Ссылка.Метаданные().Имя+".РаботникиОрганизации КАК РаботникиОрганизации
	|ГДЕ	РаботникиОрганизации.НомерСтроки в (&парамСтроки)
	|	И	РаботникиОрганизации.Ссылка = &парамСсылка
	|// -Конец Автозаполнение_ТабличнаяЧастьРаботники()                              
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции  // Автозаполнение_ТабличнаяЧастьРаботники()

Функция		Автозаполнение_Даты(Запрос, ДатаМесяца)
	
	ТекДата = НачалоМесяца(ДатаМесяца);
	КонДата = КонецМесяца(ДатаМесяца);
	Запрос.УстановитьПараметр("Дата"+День(ТекДата),	ТекДата);
	ТекстЗапроса = "			ВЫБРАТЬ &Дата"+День(ТекДата)+" КАК ДеньМесяца";
	
	ТекДата = ТекДата + 86400;	
	Пока ТекДата <= КонДата Цикл
		Запрос.УстановитьПараметр("Дата"+День(ТекДата),	ТекДата);
		ТекстЗапроса = ТекстЗапроса + " 
		|			ОБЪЕДИНИТЬ ВСЕ
		|			ВЫБРАТЬ &Дата"+День(ТекДата)+" КАК ДеньМесяца";
		ТекДата = ТекДата + 86400;	
	КонецЦикла;
	
	Возврат ТекстЗапроса;
	
КонецФункции     // Автозаполнение_Даты()

Функция		Автозаполнение_НачисленияПоДатам(Запрос, ДатаМесяца)
	
 	Текст_Даты = Автозаполнение_Даты(Запрос, ДатаМесяца);
	ТекстЗапроса = "
	|                                 
	|// -начало Автозаполнение_НачисленияПоДатам()                              
	|                                 
	|ВЫБРАТЬ
	|	Начисления.ФизЛицо	КАК ФизЛицо,
	|	Начисления.Приказ	КАК Приказ,
	|	МесяцПоДням.ДеньМесяца			КАК ДеньМесяца,
	|	Начисления.ВидРасчета           КАК ВидРасчета
	|
	|ИЗ ( " + Текст_Даты + " ) КАК МесяцПоДням
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ (
	|	ВЫБРАТЬ
	|		Начисления.ФизЛицо					КАК ФизЛицо,
	|		Начисления.Приказ					КАК Приказ,
	|		Начисления.ПериодДействияНачало		КАК ПериодДействияНачало,
	|		Начисления.ПериодДействияКонец		КАК ПериодДействияКонец,
	|		Начисления.ВидРасчета				КАК ВидРасчета
	|	ИЗ РегистрРасчета.Начисления КАК Начисления
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ("+Автозаполнение_ТабличнаяЧастьРаботники()+") КАК Сотр
	|	ПО		Начисления.ФизЛицо = Сотр.ФизЛицо                                 
	|		И	Начисления.Приказ = Сотр.Приказ                                 
	|	ГДЕ		Начисления.Организация = &парамОрганизация 
	|		И	Начисления.ФизЛицо в (&парамФизЛицо)
	|		И	НАЧАЛОПЕРИОДА(Начисления.ПериодДействия,МЕСЯЦ) = &НачалоМесяца
	|		И	Начисления.ПериодРегистрации <= &НачалоМесяца
	|		И	(Начисления.ВидРасчета.ЗачетОтработанногоВремени  // только те, которые влияют на учет времени
	|		ИЛИ  Начисления.ВидРасчета.ЗачетНормыВремени
	|		ИЛИ  Начисления.ВидРасчета.УчитыватьКалендарные)
	|       И НЕ (Начисления.ВидРасчета В (&парамНочныеВечерние))
	|) КАК Начисления 
	|ПО МесяцПоДням.ДеньМесяца МЕЖДУ Начисления.ПериодДействияНачало И Начисления.ПериодДействияКонец
	|                                 
	|// -Конец Автозаполнение_НачисленияПоДатам()                              
	|                                 
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции  // Автозаполнение_НачисленияПоДатам()

Функция		Автозаполнение_Начисления(Запрос, ДатаМесяца)
	
 	Текст_НачисленияПоДатам = Автозаполнение_НачисленияПоДатам(Запрос, ДатаМесяца);
	ТекстЗапроса_СчетчикВытесняемые = "
	|	ВЫБРАТЬ
	|		Нач.ФизЛицо					КАК ФизЛицо,
	|		Нач.Приказ					КАК Приказ,
	|		Нач.ДеньМесяца				КАК ДеньМесяца,
	|		Нач.ВидРасчета				КАК ВидРасчета,
	|		СУММА(Нач.СчетчикВытесняемых)			КАК СчетчикВытесняемых
	|	ИЗ(
	|		ВЫБРАТЬ
	|			Начисления1.ФизЛицо		КАК ФизЛицо,
	|			Начисления1.Приказ		КАК Приказ,
	|			Начисления1.ДеньМесяца	КАК ДеньМесяца,
	|			Начисления1.ВидРасчета	КАК ВидРасчета,
	|			1						КАК СчетчикВытесняемых
	|		ИЗ ( "+Текст_НачисленияПоДатам+" ) КАК Начисления1
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ( "+Текст_НачисленияПоДатам+" ) КАК Начисления2
	|		ПО		Начисления1.ФизЛицо = Начисления2.ФизЛицо
	|			И	Начисления1.Приказ = Начисления2.Приказ
	|			И	Начисления1.ДеньМесяца = Начисления2.ДеньМесяца
	|			И	Начисления1.ВидРасчета <> Начисления2.ВидРасчета
	|                                 
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.ВытесняющиеВидыРасчета КАК ВытесняемыеВР
	|		ПО  	Начисления1.ВидРасчета = ВытесняемыеВР.Ссылка
	|   		И	Начисления2.ВидРасчета = ВытесняемыеВР.ВидРасчета                            
	|   	ГДЕ  ВытесняемыеВР.ВидРасчета ЕСТЬ NULL                             
	|	)КАК Нач                              
	|	СГРУППИРОВАТЬ ПО
	|		Нач.ФизЛицо,
	|		Нач.Приказ,
	|		Нач.ДеньМесяца,
	|		Нач.ВидРасчета
	|";                                     
	
	ТекстЗапроса = "
	|                                 
	|// -начало Автозаполнение_Начисления()                              
	|                                 
	|ВЫБРАТЬ
	|	ИтогНачисления.ФизЛицо					КАК ФизЛицо,
	|	ИтогНачисления.Приказ					КАК Приказ,
	|	ИтогНачисления.ДеньМесяца				КАК ДеньМесяца,
	|	СчетчикВытесняемые.ВидРасчета			КАК ВидРасчета
	|ИЗ	(
	|	ВЫБРАТЬ
	|		Начисления1.ФизЛицо					КАК ФизЛицо,
	|		Начисления1.Приказ					КАК Приказ,
	|		Начисления1.ДеньМесяца				КАК ДеньМесяца,
	|		МАКСИМУМ(СчетчикВытесняемых)			КАК СчетчикВытесняемых
	|	ИЗ ( "+ТекстЗапроса_СчетчикВытесняемые+" ) КАК Начисления1
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Начисления1.ФизЛицо,
	|		Начисления1.Приказ,
	|		Начисления1.ДеньМесяца
	|   )КАК ИтогНачисления                              
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ( "+ТекстЗапроса_СчетчикВытесняемые+" ) КАК СчетчикВытесняемые
	|	ПО		ИтогНачисления.ФизЛицо = СчетчикВытесняемые.ФизЛицо
	|		И	ИтогНачисления.Приказ = СчетчикВытесняемые.Приказ
	|		И	ИтогНачисления.ДеньМесяца = СчетчикВытесняемые.ДеньМесяца
	|		И	ИтогНачисления.СчетчикВытесняемых = СчетчикВытесняемые.СчетчикВытесняемых
	|                                 
	|// -конец Автозаполнение_Начисления()                              
	|                                 
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции  // Автозаполнение_Начисления()

Функция		Автозаполнение_Работники()
	
	ТекстЗапроса = "
	|                                 
	|// -начало Автозаполнение_Работники()                              
	|                                 
	|ВЫБРАТЬ
	|	Работники.ФизЛицо				КАК ФизЛицо,
	|	Работники.Приказ				КАК Приказ,
	|	Работники.ГрафикРаботы			КАК ГрафикРаботы,
	|	Работники.Период				КАК НачалоПериода,
	|	МИНИМУМ(ВЫБОР КОГДА Работники2.Период ЕСТЬ НЕ NULL ТОГДА Работники2.Период ИНАЧЕ &КонецМесяца КОНЕЦ )		КАК КонецПериода
	|
	|ИЗ	РегистрСведений.РаботникиОрганизаций КАК Работники
	|                                 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники2                                
	|	ПО		Работники.ФизЛицо = Работники2.ФизЛицо
	|		И	Работники.Приказ = Работники2.Приказ
	|		И	Работники.Период < Работники2.Период
	|                                 
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ("+Автозаполнение_ТабличнаяЧастьРаботники()+") КАК Сотр
	|ПО		Работники.ФизЛицо = Сотр.ФизЛицо                                 
	|	И	Работники.Приказ = Сотр.Приказ                                 
	|ГДЕ Работники.ФизЛицо в (&парамФизЛицо)
	|                                 
	|СГРУППИРОВАТЬ ПО
	|	Работники.ФизЛицо,
	|	Работники.Приказ,
	|	Работники.ГрафикРаботы,
	|	Работники.Период
	|                                 
	|// -Конец Автозаполнение_Работники()                              
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции  // Автозаполнение_Работники()

Функция		Автозаполнение_НачисленияГрафик(Запрос, ДатаМесяца)
	
 	Текст_Начисления = Автозаполнение_Начисления(Запрос, ДатаМесяца);
 	Текст_РаботникиОрганизаций = Автозаполнение_Работники();
	
	ТекстЗапроса = "
	|                                 
	|   // -начало Автозаполнение_НачисленияГрафик()                              
	|                                 
	|ВЫБРАТЬ
	|	Начисления.ФизЛицо					КАК ФизЛицо,
	|	Начисления.Приказ					КАК Приказ,
	|	Начисления.ДеньМесяца				КАК ДеньМесяца,
	|	Начисления.ВидРасчета				КАК ВидРасчета,
	|	РаботникиОрганизаций.ГрафикРаботы	КАК ГрафикРаботы
	|ИЗ	( "+Текст_Начисления+" ) КАК Начисления
	|                                 
	|ЛЕВОЕ СОЕДИНЕНИЕ ( "+Текст_РаботникиОрганизаций+" )  КАК РаботникиОрганизаций                                 
	|                                 
	|	ПО		Начисления.ФизЛицо = РаботникиОрганизаций.ФизЛицо
	|		И	Начисления.Приказ = РаботникиОрганизаций.Приказ
	|		И	Начисления.ДеньМесяца МЕЖДУ РаботникиОрганизаций.НачалоПериода И РаботникиОрганизаций.КонецПериода
	|                                 
	|   // -Конец Автозаполнение_НачисленияГрафик()                              
	|                                 
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции  // Автозаполнение_НачисленияГрафик()

Функция		Автозаполнение_РеальноеРабочееВремя(Запрос, ДатаМесяца)
	
 	Текст_НачисленияГрафик = Автозаполнение_НачисленияГрафик(Запрос, ДатаМесяца);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ
	|	ВТТекст_НачисленияГрафик
	|ИЗ
	|	(" + Текст_НачисленияГрафик + ")  КАК Текст_НачисленияГрафик
	|";
	Запрос.Выполнить();
	
	ТекстЗапроса = "
	|                                 
	|// -начало Автозаполнение_РеальноеРабочееВремя()                              
	|// основное время + невыходы                                 
	|ВЫБРАТЬ 
	|	НачисленияГрафик.ФизЛицо					КАК ФизЛицо,
	|	НачисленияГрафик.Приказ						КАК Приказ,
	|	НачисленияГрафик.ДеньМесяца					КАК ДеньМесяца,
	|	НачисленияГрафик.ВидРасчета					КАК ВидРасчета,
	|	НачисленияГрафик.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени	КАК ВидИспользованияРабочегоВремени,
	|	НачисленияГрафик.ГрафикРаботы				КАК ГрафикРаботы,
	|	ГрафикПоВидамВремени.ДополнительноеЗначение	КАК Дней,
	|	ГрафикПоВидамВремени.ОсновноеЗначение		КАК Часов
	|ИЗ	ВТТекст_НачисленияГрафик КАК НачисленияГрафик
	|                                 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени  КАК ГрафикПоВидамВремени                                 
	|	ПО		НачисленияГрафик.ГрафикРаботы = ГрафикПоВидамВремени.ГрафикРаботы
	|		И	НачисленияГрафик.ДеньМесяца = ГрафикПоВидамВремени.Дата
	|		И	ГрафикПоВидамВремени.ВидучетаВремени = &ПоЧасам
	|                                 
	|// ночные                                 
	|ОБЪЕДИНИТЬ ВСЕ                                 
	|ВЫБРАТЬ 
	|	НачисленияГрафик.ФизЛицо					КАК ФизЛицо,
	|	НачисленияГрафик.Приказ						КАК Приказ,
	|	НачисленияГрафик.ДеньМесяца					КАК ДеньМесяца,
	|	НачисленияГрафик.ВидРасчета					КАК ВидРасчета,
	|	&УчетВремениНочноеВремя						КАК ВидИспользованияРабочегоВремени,
	|	НачисленияГрафик.ГрафикРаботы				КАК ГрафикРаботы,
	|	ГрафикПоВидамВремени.ДополнительноеЗначение	КАК Дней,
	|	ГрафикПоВидамВремени.ОсновноеЗначение		КАК Часов
    |ИЗ	ВТТекст_НачисленияГрафик КАК НачисленияГрафик
	|                                 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени  КАК ГрафикПоВидамВремени                                 
	|	ПО		НачисленияГрафик.ГрафикРаботы = ГрафикПоВидамВремени.ГрафикРаботы
	|		И	НачисленияГрафик.ДеньМесяца = ГрафикПоВидамВремени.Дата
	|		И	ГрафикПоВидамВремени.ВидучетаВремени = &ПоНочнымЧасам
	|ГДЕ 	НачисленияГрафик.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени.ВидВремени в (&ОтработанноеВремя)                                 
	|	И ( ГрафикПоВидамВремени.ДополнительноеЗначение <> 0 ИЛИ ГрафикПоВидамВремени.ОсновноеЗначение <> 0 )                                
	|                                 
	|// вечерние                                 
	|ОБЪЕДИНИТЬ ВСЕ                                 
	|ВЫБРАТЬ 
	|	НачисленияГрафик.ФизЛицо					КАК ФизЛицо,
	|	НачисленияГрафик.Приказ						КАК Приказ,
	|	НачисленияГрафик.ДеньМесяца					КАК ДеньМесяца,
	|	НачисленияГрафик.ВидРасчета					КАК ВидРасчета,
	|	&УчетВремениВечернееВремя					КАК ВидИспользованияРабочегоВремени,
	|	НачисленияГрафик.ГрафикРаботы				КАК ГрафикРаботы,
	|	ГрафикПоВидамВремени.ДополнительноеЗначение	КАК Дней,
	|	ГрафикПоВидамВремени.ОсновноеЗначение		КАК Часов
	|ИЗ	ВТТекст_НачисленияГрафик КАК НачисленияГрафик
	|                                 
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени  КАК ГрафикПоВидамВремени                                 
	|	ПО		НачисленияГрафик.ГрафикРаботы = ГрафикПоВидамВремени.ГрафикРаботы
	|		И	НачисленияГрафик.ДеньМесяца = ГрафикПоВидамВремени.Дата
	|		И	ГрафикПоВидамВремени.ВидучетаВремени = &ПоВечернимЧасам
	|ГДЕ	НачисленияГрафик.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени.ВидВремени в (&ОтработанноеВремя)                                 
	|	И	( ГрафикПоВидамВремени.ДополнительноеЗначение <> 0 ИЛИ ГрафикПоВидамВремени.ОсновноеЗначение <> 0 )                                
	|                                 
	|// -конец Автозаполнение_РеальноеРабочееВремя()                              
	|                                 
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции  // Автозаполнение_РеальноеРабочееВремя()

Функция		Автозаполнение_ПоТабелюРабочееВремя()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	РабочееВремя.ФизЛицо	КАК ФизЛицо,
	|	РабочееВремя.Приказ 	КАК Приказ,
	|	РабочееВремя.Период 	КАК ДеньМесяца,
	|	РабочееВремя.ВидИспользованияРабочегоВремени КАК ВидИспользованияРабочегоВремени,
	|	РабочееВремя.Дней		КАК Дней,
	|	РабочееВремя.Часов		КАК Часов
	|ИЗ
	|	РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремя
	|                                 
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ("+Автозаполнение_ТабличнаяЧастьРаботники()+") КАК Сотр
	|ПО		РабочееВремя.ФизЛицо = Сотр.ФизЛицо                                 
	|	И	РабочееВремя.Приказ = Сотр.Приказ                                 
	|                                 
	|ГДЕ
	|	РабочееВремя.Организация = &парамОрганизация
	|	И РабочееВремя.ФизЛицо в (&парамФизЛицо)
	|	И РабочееВремя.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И РабочееВремя.Регистратор <> &парамСсылка
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции  // Автозаполнение_ПоТабелюРабочееВремя()

Функция		Автозаполнение_РабочееВремя(Запрос, ДатаМесяца)
	
	Текст_РеальноеРабочееВремя = Автозаполнение_РеальноеРабочееВремя(Запрос, ДатаМесяца);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ
	|	ВТТекст_РеальноеРабочееВремя
	|ИЗ
	|	(" + Текст_РеальноеРабочееВремя + ")  КАК Текст_РеальноеРабочееВремя
	|";
	Запрос.Выполнить();
	
	Текст_ПоТабелюРабочееВремя = Автозаполнение_ПоТабелюРабочееВремя();
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ
	|	ВТТекст_ПоТабелюРабочееВремя
	|ИЗ
	|	(" + Текст_ПоТабелюРабочееВремя + ") КАК Текст_ПоТабелюРабочееВремя
	|";
	Запрос.Выполнить();
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	РабочееВремя.ФизЛицо	КАК ФизЛицо,
	|	РабочееВремя.Приказ 	КАК Приказ,
	|	РабочееВремя.ДеньМесяца КАК ДатаНачала,     //даты приводим к форме удобной для документа
	|	РабочееВремя.ДеньМесяца КАК ДатаОкончания,
	|	РабочееВремя.ВидИспользованияРабочегоВремени КАК ВидИспользованияРабочегоВремени,
	|	СУММА(РабочееВремя.Дней)		КАК ВсегоДней,
	|	СУММА(РабочееВремя.Часов)		КАК ВсегоЧасов
	|ИЗ (
	|		ВЫБРАТЬ
	|			Основной.ФизЛицо	КАК ФизЛицо,
	|			Основной.Приказ 	КАК Приказ,
	|			Основной.ДеньМесяца	КАК ДеньМесяца,
	|			Основной.ВидИспользованияРабочегоВремени КАК ВидИспользованияРабочегоВремени,
	|			Основной.Дней		КАК Дней,
	|			Основной.Часов		КАК Часов
	|		ИЗ ВТТекст_РеальноеРабочееВремя  КАК Основной		
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|		ВЫБРАТЬ
	|			Основной.ФизЛицо	КАК ФизЛицо,
	|			Основной.Приказ 	КАК Приказ,
	|			Основной.ДеньМесяца	КАК ДеньМесяца,
	|			Основной.ВидИспользованияРабочегоВремени КАК ВидИспользованияРабочегоВремени,
	|			-Основной.Дней		КАК Дней,
	|			-Основной.Часов		КАК Часов
	|		ИЗ ВТТекст_ПоТабелюРабочееВремя КАК Основной
	|)КАК РабочееВремя
	|
	|ГДЕ РабочееВремя.ФизЛицо ЕСТЬ НЕ NULL
	|И РабочееВремя.ВидИспользованияРабочегоВремени ЕСТЬ НЕ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочееВремя.ФизЛицо,
	|	РабочееВремя.Приказ,
	|	РабочееВремя.ДеньМесяца,
	|	РабочееВремя.ВидИспользованияРабочегоВремени
	|ИМЕЮЩИЕ 
	|	СУММА(РабочееВремя.Дней) <> 0 Или
	|	СУММА(РабочееВремя.Часов) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочееВремя.ФизЛицо.Наименование,
	|	РабочееВремя.ДеньМесяца,
	|	РабочееВремя.ВидИспользованияРабочегоВремени.ЦифровойКод
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции  // Автозаполнение_РабочееВремя()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Результат запроса
//
Функция СформироватьЗапросПоШапке()

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",			Ссылка);
	Запрос.УстановитьПараметр("парамПустаяОрганизация",	Справочники.Организации.ПустаяСсылка());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	КорректировкаИспользованияРаботникамиРабочегоВремени.Дата,
	|	КорректировкаИспользованияРаботникамиРабочегоВремени.ПериодРегистрации,
	|	КорректировкаИспользованияРаботникамиРабочегоВремени.РазвернутыйПериод,
	|	ВЫБОР
	|		КОГДА КорректировкаИспользованияРаботникамиРабочегоВремени.Организация.ГоловнаяОрганизация = &парамПустаяОрганизация
	|			ТОГДА КорректировкаИспользованияРаботникамиРабочегоВремени.Организация
	|		ИНАЧЕ КорректировкаИспользованияРаботникамиРабочегоВремени.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	КорректировкаИспользованияРаботникамиРабочегоВремени.Ссылка
	|ИЗ
	|	Документ.КорректировкаИспользованияРаботникамиРабочегоВремени КАК КорректировкаИспользованияРаботникамиРабочегоВремени
	|ГДЕ
	|	КорректировкаИспользованияРаботникамиРабочегоВремени.Ссылка = &ДокументСсылка";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по таблице "ОтработанноеВремя" документа
//
// Параметры:
//	ВыборкаПоШапкеДокумента
//
// Возвращаемое значение:
//	Результат запроса.
//
Функция СформироватьЗапросПоОтработанноеВремя(ВыборкаПоШапкеДокумента)

	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",					Ссылка);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",			ВыборкаПоШапкеДокумента.ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("ПустаяДата",						Дата('00010101'));
	Запрос.УстановитьПараметр("СписокНедопустимыхВидовВремени",	ПолучитьСписокНедопустимыхВидовВремени());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтрокиТЧ.ФизЛицо,
	|	СтрокиТЧ.Приказ,
	|	СтрокиТЧ.ВидИспользованияРабочегоВремени КАК ВидИспользованияРабочегоВремени,
	|	СтрокиТЧ.ВидИспользованияРабочегоВремени.ВидВремени КАК ВидВремени,
	|	ВЫБОР
	|		КОГДА СтрокиТЧ.ВидИспользованияРабочегоВремени.ВидВремени В (&СписокНедопустимыхВидовВремени)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НедопустимыйВидВремени,
	|	СтрокиТЧ.ДатаНачала КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА СтрокиТЧ.ДатаОкончания <> &ПустаяДата
	|			ТОГДА НАЧАЛОПЕРИОДА(СтрокиТЧ.ДатаОкончания, ДЕНЬ)
	|		ИНАЧЕ &ПустаяДата
	|	КОНЕЦ КАК ДатаОкончания,
	|	СтрокиТЧ.НомерСтроки КАК НомерСтроки,
	|	СтрокиТЧ.ВсегоДней КАК ВсегоДней,
	|	СтрокиТЧ.ВсегоЧасов КАК ВсегоЧасов,
	|	ВЫБОР
	|		КОГДА СтрокиТЧ.Приказ.Организация = &ГоловнаяОрганизация
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации
	|ИЗ
	|	Документ.КорректировкаИспользованияРаботникамиРабочегоВремени.ОтработанноеВремя КАК СтрокиТЧ
	|ГДЕ
	|	СтрокиТЧ.Ссылка = &ДокументСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоОтработанноеВремя()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизитов шапки, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//	ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//	Отказ					- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок = "")

	//  Организация
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ГоловнаяОрганизация) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='Не указана организация, по которой вводится рабочее время!';uk='Не вказана організація, по якій вводиться робочий час!'"), Отказ, Заголовок);
	КонецЕсли;
	
	// ПериодРегистрации
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ПериодРегистрации) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(НСтр("ru='Не указан период регистрации!';uk='Не зазначений період реєстрації!'"), Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "ОтработанноеВремя" документа.
// Если какой-то из реквизтов, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса к ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//	ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//								  из результата запроса к ТЧ документа,
//	Отказ						- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеСтрокиОтработанноеВремя(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок = "", УчетнаяПолитикаПоПерсоналуОрганизации)

	СтрокаНачалаСообщенияОбОшибке = НСтр("ru='В строке номер ""';uk='У рядку номер ""'")+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
									НСтр("ru='"" табл. части ""Отработанное время"": ';uk='"" табл. частини ""Відпрацьований час"": '");
	
	// ФизЛицо
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ФизЛицо) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не заполнено физ.лицо!';uk='не заповнена фіз. особа!'"), Отказ, Заголовок);
	КонецЕсли;

	// Приказ
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Приказ) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не выбран приказ!';uk='не вибраний наказ!'"), Отказ, Заголовок);
	КонецЕсли;

	// Организация сотрудника должна совпадать с организацией документа
	Если ВыборкаПоСтрокамДокумента.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='указанный сотрудник оформлен на другую организацию!';uk='зазначений співробітник оформлений на іншу організацію!'"), Отказ, Заголовок);
	КонецЕсли;
	
	// ВидИспользованияРабочегоВремени
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидИспользованияРабочегоВремени) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указано использование рабочего времени!';uk='не вказано використання робочого часу!'"), Отказ, Заголовок);
	КонецЕсли;

	// Дата начала
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаНачала) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указана дата начала периода!';uk='не вказана дата початку періоду!'"), Отказ, Заголовок);
	Иначе
		Если НачалоМесяца(ВыборкаПоСтрокамДокумента.ДатаНачала) <> ВыборкаПоШапкеДокумента.ПериодРегистрации Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='дата начала периода не совпадает с месяцем, за который составлен документ!';uk='дата початку періоду не збігається з місяцем, за який складений документ!'"), Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;

	// Дата окончания
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаОкончания) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указана дата окончания периода!';uk='не вказана дата закінчення періоду!'"), Отказ, Заголовок);
	Иначе
		Если НачалоМесяца(ВыборкаПоСтрокамДокумента.ДатаОкончания) <> ВыборкаПоШапкеДокумента.ПериодРегистрации Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='дата окончания периода не совпадает с месяцем, за который составлен документ!';uk='дата закінчення періоду не збігається з місяцем, за який складений документ!'"), Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;

	// Режим однодатного ввода
	Если НЕ ВыборкаПоШапкеДокумента.РазвернутыйПериод Тогда
		Если ВыборкаПоСтрокамДокумента.ДатаНачала <> ВыборкаПоСтрокамДокумента.ДатаОкончания Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='в режиме ввода данных за каждую дату начало и конец периода должны совпадать!';uk='в режимі введення даних за кожну дату початок і кінець періоду повинні співпадати!'"), Отказ, Заголовок);
		КонецЕсли;
		
		Если ВыборкаПоСтрокамДокумента.ВсегоЧасов > 24 Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='в режиме ввода данных за каждую дату число часов не должно превышать 24!';uk='в режимі введення даних за кожну дату число годин не повинно перевищувати 24!'"), Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;

	// Вид времени
	Если ВыборкаПоСтрокамДокумента.НедопустимыйВидВремени Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='нельзя в документе указывать ';uk='не можна указувати в документі вказувати '") + ВыборкаПоСтрокамДокумента.ВидИспользованияРабочегоВремени, Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеСтрокиНачисления()

// По строке выборок из результатов запроса по документу формируем движения по регистрам
//
// Параметры:
//	ВыборкаПоСтрокамДокумента				- спозиционированная на определеной строке выборка 
//											  из результата запроса к ТЧ документа, 
//	НаборЗаписей							- набор записей для РабочееВремяРаботниковОрганизаций 
//
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуОтработанноеВремя(ВыборкаПоСтрокамДокумента, ВыборкаПоШапкеДокумента, НаборЗаписей)

	Движение = НаборЗаписей.Добавить();

	// Свойства
	Движение.Период								= НачалоДня(ВыборкаПоСтрокамДокумента.ДатаОкончания);

	// Измерения
	Движение.ФизЛицо							= ВыборкаПоСтрокамДокумента.ФизЛицо;
	Движение.Приказ								= ВыборкаПоСтрокамДокумента.Приказ;
	Движение.Организация						= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	Движение.ВидИспользованияРабочегоВремени	= ВыборкаПоСтрокамДокумента.ВидИспользованияРабочегоВремени;

	// Ресурсы
	Движение.Дней								= ВыборкаПоСтрокамДокумента.ВсегоДней;
	Движение.Часов								= ВыборкаПоСтрокамДокумента.ВсегоЧасов;

	// Реквизиты
	Движение.СводнаяЗапись						= (ВыборкаПоСтрокамДокумента.ВсегоДней > 1) 
												  Или (ВыборкаПоСтрокамДокумента.ДатаНачала <> ВыборкаПоСтрокамДокумента.ДатаОкончания);
КонецПроцедуры // ДобавитьСтрокуОтработанноеВремя()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Отказ = Истина;
	Возврат;
	
	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
	Если ВыборкаПоШапкеДокумента.Следующий() Тогда

		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);

		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда

			////////////////////////////////////////////////////////////////////////
			// Отработанное время

			// получим реквизиты табличной части
			ВыборкаПоОтработанноеВремя = СформироватьЗапросПоОтработанноеВремя(ВыборкаПоШапкеДокумента).Выбрать();
			УчетнаяПолитикаПоПерсоналуОрганизации = глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации");

			Пока ВыборкаПоОтработанноеВремя.Следующий() Цикл 

				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиОтработанноеВремя(ВыборкаПоШапкеДокумента, ВыборкаПоОтработанноеВремя, Отказ, Заголовок, УчетнаяПолитикаПоПерсоналуОрганизации);
				Если НЕ Отказ Тогда
					// Заполним записи в наборах записей регистров
					ДобавитьСтрокуОтработанноеВремя(ВыборкаПоОтработанноеВремя, ВыборкаПоШапкеДокумента, Движения.РабочееВремяРаботниковОрганизаций);
				КонецЕсли;
			КонецЦикла;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры // ОбработкаПроведения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
    	Возврат;
	КонецЕсли;
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(ОтработанноеВремя);
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
